In [1]:
import pandas as pd
import numpy as np
import matplotlib as plt
import mysql.connector
import sqlalchemy

In [2]:
mydb= mysql.connector.connect(
    host = 'localhost',
    user = 'root',
    password = 'codingzone9',
    database = 'retrowheels'
)

In [3]:
mycursor = mydb.cursor()
mycursor.execute('''
show full tables;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

  Tables_in_retrowheels  Table_type
0             customers  BASE TABLE
1             employees  BASE TABLE
2               offices  BASE TABLE
3          orderdetails  BASE TABLE
4                orders  BASE TABLE
5              payments  BASE TABLE
6          productlines  BASE TABLE
7              products  BASE TABLE

# 1.

In [4]:
mycursor = mydb.cursor()
mycursor.execute('''
select count(customername) as Customers, count(distinct(city)) as Cities, count(distinct(country)) as Countries from customers;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   Customers  Cities  Countries
0        122      95         27

# 2.

In [5]:
mycursor = mydb.cursor()
mycursor.execute('''
select count(distinct(employees.employeenumber)) as Employees, count(distinct(offices.officecode)) as Offices, count(distinct(customers.country)) as Country, count(distinct(products.productname)) as Products, sum(distinct(products.quantityinstock)) as StockProducts, count(distinct(products.productvendor)) as Vendors from employees, offices, customers, products
where offices.officecode = employees.officecode and offices.officecode = employees.officecode;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

   Employees  Offices  Country  Products StockProducts  Vendors
0         23        7       27       110        555131       13

# 3.

In [6]:
mycursor = mydb.cursor()
mycursor.execute('''
select distinct(products.productline) as productLine, min(products.buyprice) as minPrice, max(products.buyprice) as maxPrice from products, orderdetails, orders
where products.productcode = orderdetails.productcode and products.productcode = orderdetails.productcode
group by products.productline
order by products.productline;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

        productLine minPrice maxPrice
0      Classic Cars    15.91   103.42
1       Motorcycles    24.14    91.02
2            Planes    29.34    77.27
3             Ships    33.30    82.34
4            Trains    26.72    67.56
5  Trucks and Buses    24.92    84.76
6      Vintage Cars    20.61    86.70

# 4.

In [7]:
mycursor = mydb.cursor()
mycursor.execute('''
select customers.customername as customerName, customers.city, customers.country, payments.amount as total from customers, payments
where payments.customernumber = payments.customernumber
order by payments.amount desc limit 10;

''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

                   customerName           city    country      total
0             La Rochelle Gifts         Nantes     France  120166.58
1             Land of Toys Inc.            NYC        USA  120166.58
2               Mini Wheels Co.  San Francisco        USA  120166.58
3    Australian Collectors, Co.      Melbourne  Australia  120166.58
4          Blauer See Auto, Co.      Frankfurt    Germany  120166.58
5             Atelier graphique         Nantes     France  120166.58
6            Baane Mini Imports        Stavern     Norway  120166.58
7            Havel & Zbyszek Co       Warszawa     Poland  120166.58
8  Mini Gifts Distributors Ltd.     San Rafael        USA  120166.58
9            Signal Gift Stores      Las Vegas        USA  120166.58

# 5.

In [1]:
mycursor = mydb.cursor()
mycursor.execute('''
select customers.customername, products.productname, orderdetails.priceeach, orderdetails.quantityordered from customers, products, orderdetails;
''')
myresult= mycursor.fetchall()
columns= mycursor.column_names
tables= pd.DataFrame(myresult, columns=columns)
tables

NameError: name 'mydb' is not defined